type DateItemType = {
    id: string;
    date: number;
    events: string;
};

export const dates: number[][] = [
    [1980, 1986],
    [1987, 1991],
    [1992, 1997],
    [1999, 2004],
    [2006, 2014],
    [2015, 2022],
];

export const timeEvents: DateItemType[][] = [
    [
        {
            id: "0",
            date: 1980,
            events: "Sinclair Research выпускает домашний компьютер ZX80",
        },
        {
            id: "1",
            date: 1981,
            events: "Выпуск компьютера Apple IIe.",
        },
        {
            id: "2",
            date: 1983,
            events: "Началась коммерческая эксплуатация первой сети AMPS",
        },
        {
            id: "3",
            date: 1984,
            events: "Создание системы DNS — важнейшее условие развития Интернет.",
        },
        {
            id: "4",
            date: 1986,
            events: "Компания IBM выпустила первый в мире лэптоп IBM PC Convertible.",
        },
    ],
    [
        {
            id: "0",
            date: 1987,
            events: "«Хищник»/Predator, США (реж. Джон Мактирнан)",
        },
        {
            id: "1",
            date: 1988,
            events: "«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис)",
        },
        {
            id: "2",
            date: 1989,
            events: "«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)",
        },
        {
            id: "3",
            date: 1990,
            events: "«Крепкий орешек»/Die Hard 2, США (реж. Ренни Харлин)",
        },
        {
            id: "4",
            date: 1991,
            events: "«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненфельд)",
        },
    ],
    [
        {
            id: "0",
            date: 1992,
            events: "Нобелевская премия по литературе - Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах.»",
        },
        {
            id: "1",
            date: 1994,
            events: "«Бессоница» - Стивена Кинга.",
        },
        {
            id: "2",
            date: 1989,
            events: "«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)",
        },
        {
            id: "3",
            date: 1990,
            events: "«Крепкий орешек»/Die Hard 2, США (реж. Ренни Харлин)",
        },
        {
            id: "4",
            date: 1991,
            events: "«Семейка Аддамс»/The Addams Family, США (реж. Барри Зонненфельд)",
        },
    ],
    [
        {
            id: "0",
            date: 1999,
            events: "Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пильона",
        },
        {
            id: "1",
            date: 2000,
            events: "Возобновление издание журнала «Театр».",
        },
        {
            id: "2",
            date: 2002,
            events: "Премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон.",
        },
    ],
    [
        {
            id: "0",
            date: 2006,
            events: "Баскетбольный клуб ЦСКА стал победителем национального первенства России.",
        },
        {
            id: "1",
            date: 2008,
            events: "С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры.",
        },
        {
            id: "2",
            date: 2012,
            events: "2 августа - Летние Олимпийские игры.",
        },
        {
            id: "3",
            date: 2014,
            events: "XXII зимние Олимпийские игры (Сочи, Россия).",
        },
    ],
    [
        {
            id: "0",
            date: 2015,
            events: "13 сентября - частное солнечное затмение, видимое в Южной Африке и части Антарктиды.",
        },
        {
            id: "1",
            date: 2016,
            events: "телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик получившую обозначение GN-z11.",
        },
        {
            id: "2",
            date: 2017,
            events: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.",
        },
        {
            id: "3",
            date: 2020,
            events: "Корабль Crew Dragon вернулся на Землю из первого пилотного полета.",
        },
    ],
];
